In [1]:
import pandas as pd
import numpy as np

In [18]:
# Create dummy data
stuff = {"A": [1, 2, 3], "B": [4, np.nan, 6], "C": [7, 8, 9], "D": [10, 11, 12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [10]:
# Drop rows with null data: for permanent use inplace=True
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10

In [11]:
# Drop columns with null data
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [17]:
# More than one? Set threshold
# my_df.dropna(thresh=1, axis=1) # the column will be deleted if there is only one null value
my_df.dropna(thresh=2, axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [19]:
# Replace null values
my_df.fillna(value="Oggy")

   A     B  C   D
0  1   4.0  7  10
1  2  Oggy  8  11
2  3   6.0  9  12

In [22]:
# use math functions
my_df.fillna(value=my_df["B"].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12